ChartsOfCharacteristicTypes/МИКО_мвНастройкиМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>МИКО_мвНастройкиМаршрутизации</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>6</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>256</v8:Length>
				</v8:StringQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.МИКО_мвНастройкиМаршрутизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

InformationRegisters/МИКО_мвДанныеПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_мвДанныеПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчаствуетВГолосовомМеню</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_РП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ДП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ВП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолПользователя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МИКО_мвПолПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/МИКО_мвПолПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МИКО_мвПолПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ChartsOfCharacteristicTypes/МИКО_мвНастройкиМаршрутизации/Forms/ФормаНастройкиСпискаПользователей/Ext/Form/Module.bsl
// #Область СлужебныеПроцедурыИФункции

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИерархическийСправочник 	= Метаданные.Справочники.Пользователи.Иерархический;
	ЕстьРеквизитНедействителен 	= Метаданные.Справочники.Пользователи.Реквизиты.Найти("Недействителен")<>Неопределено;
	
	// Заполним таблицу пользователей данными из РС "МИКО_мвДанныеПользователей".
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
       |	ВЫБОР
       |		КОГДА ЕСТЬNULL(МИКО_мвДанныеПользователей.УчаствуетВГолосовомМеню, 0) = 0
       |			ТОГДА НЕ Пользователи.ПометкаУдаления
       |		ИНАЧЕ МИКО_мвДанныеПользователей.УчаствуетВГолосовомМеню
       |	КОНЕЦ КАК УчаствуетВГолосовомМеню,
       |	ЕСТЬNULL(МИКО_мвДанныеПользователей.ФИО_РП, """") КАК ФИО_РП,
       |	ЕСТЬNULL(МИКО_мвДанныеПользователей.ФИО_ДП, """") КАК ФИО_ДП,
       |	ЕСТЬNULL(МИКО_мвДанныеПользователей.ФИО_ВП, """") КАК ФИО_ВП,
       |	ЕСТЬNULL(МИКО_мвДанныеПользователей.ФИО_ТП, """") КАК ФИО_ТП,
       |	ЕСТЬNULL(МИКО_мвДанныеПользователей.ФИО_ПП, """") КАК ФИО_ПП,
	   |	ЕСТЬNULL(МИКО_мвДанныеПользователей.ПериодНачало, ДАТАВРЕМЯ(1,1,1,0,0,0)) КАК ПериодНачало,
       |	ВЫБОР
       |		КОГДА ЕСТЬNULL(МИКО_мвДанныеПользователей.Пользователь, 0) = 0
       |			ТОГДА ИСТИНА
       |		ИНАЧЕ ЛОЖЬ
       |	КОНЕЦ КАК ОбновитьИнформацию,
       |	ЕСТЬNULL(МИКО_мвДанныеПользователей.ПолПользователя, """") КАК ПолПользователя,
       |	Пользователи.Ссылка КАК Пользователь,
	   |	//ПолеНедействителен//
	   |	Пользователи.Ссылка.Наименование КАК ФИОПользователя
       |ИЗ
       |	Справочник.Пользователи КАК Пользователи
       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МИКО_мвДанныеПользователей КАК МИКО_мвДанныеПользователей
       |		ПО (МИКО_мвДанныеПользователей.Пользователь = Пользователи.Ссылка)";
				   
	Если ИерархическийСправочник Тогда
		Запрос.Текст = Запрос.Текст + 
			"ГДЕ
	   		|	НЕ Пользователи.ЭтоГруппа";
	КонецЕсли;
				   
	Если ЕстьРеквизитНедействителен Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПолеНедействителен//", "Пользователи.Недействителен ИЛИ Пользователи.ПометкаУдаления КАК Неактивен,");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПолеНедействителен//", "Пользователи.ПометкаУдаления КАК Неактивен,");
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	СписокПользователей.Загрузить(Результат.Выгрузить());
	
	Для Каждого СтрокаТЗ Из СписокПользователей Цикл
		ОбновитьСтатусЗаполнениПараметровСклонения(СтрокаТЗ);
	КонецЦикла;
	
	// Получим системную информацию
	СтруктураДанных = МИКО_стСлужебный.ПолучитьСлужебнуюИнформацию();
	ВерсияПлатформы = СтруктураДанных.ВерсияПлатформы;
	ИспользоватьРежимМодальности = СтруктураДанных.ИспользоватьРежимМодальности;
	
	УстановитьНачальныеОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Модифицированность Тогда
		
		Если (ВерсияПлатформы = "8.2" ИЛИ ИспользоватьРежимМодальности) Тогда
			Ответ = Вопрос("Сохранить изменения перед выходом?", РежимДиалогаВопрос.ДаНетОтмена);
			
			Если Ответ = КодВозвратаДиалога.Да Тогда
				ЗаполнитьНаСервере();
			ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
				ЭтаФорма.Модифицированность = Ложь;
			Иначе
				Отказ = Истина;
			КонецЕсли;
			
		Иначе
			Попытка	
				Выполнить("ПоказатьВопрос(
				|Новый ОписаниеОповещения(""ПослеОтветаНаВопрос"", ЭтаФорма, Новый Структура(""Вопрос"", ""СохранитьНастройки"")),
				|""Сохранить изменения перед выходом?"", РежимДиалогаВопрос.ДаНетОтмена)");
				
				Отказ = Истина;
			Исключение
				Возврат;
			КонецПопытки; 
		КонецЕсли;  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СписокПользователейПользовательПриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейПолПользователяПриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейУчаствуетВСинтезеГолосовогоМенюПриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейФИО_РППриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
	ОбновитьСтатусЗаполнениПараметровСклонения(Элементы.СписокПользователей.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейФИО_ДППриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
	ОбновитьСтатусЗаполнениПараметровСклонения(Элементы.СписокПользователей.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейФИО_ВППриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
	ОбновитьСтатусЗаполнениПараметровСклонения(Элементы.СписокПользователей.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейФИО_ТППриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
	ОбновитьСтатусЗаполнениПараметровСклонения(Элементы.СписокПользователей.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейФИО_ПППриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
	ОбновитьСтатусЗаполнениПараметровСклонения(Элементы.СписокПользователей.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейОбновитьИнформациюПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	ПроверитьИзмененияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНедействителенПриИзменении(Элемент)
	
	Если ТолькоАктивные Тогда
		Элементы.СписокПользователей.ОтборСтрок = Новый ФиксированнаяСтруктура("Неактивен", Ложь);
	Иначе
		Элементы.СписокПользователей.ОтборСтрок = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейПериодНачалоПриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	Закрыть();
	
КонецПроцедуры

// Заполняет ТЗ списком пользователей из справочника пользователей
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Для каждого СтрПользователь Из СписокПользователей Цикл
		
		Если НЕ СтрПользователь.ОбновитьИнформацию Тогда
			Продолжить;
		КонецЕсли; 
		
		МенеджерЗаписи = РегистрыСведений.МИКО_мвДанныеПользователей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрПользователь);
		
		Попытка
			МенеджерЗаписи.Записать();
			СтрПользователь.ОбновитьИнформацию = Ложь;
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры // ЗаполнитьНаСервере()

&НаСервере
Процедура ПросклонятьНаСервере(Пользователь = Неопределено)
	
	// Просклоняем ФИО пользоватлей
	Попытка
		ПодключитьВнешнююКомпоненту("ОбщийМакет.МИКО_мвКомпонентаСклоненияФИО", "Decl");
		Компонента = Новый("AddIn.Decl.CNameDecl");
	Исключение
		Компонента = Неопределено;
		МИКО_стОбщегоНазначенияСервер.СообщитьПользователю("Не удалось подключить компоненту для склонения имени. Поробуйте просклонять вручную");
		Возврат;
	КонецПопытки;
	
	Для каждого СтрокаТЗ Из СписокПользователей Цикл
		
		Если Пользователь <> Неопределено И СтрокаТЗ.Пользователь <> Пользователь Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЗ.ПолПользователя = Перечисления.МИКО_мвПолПользователей.Мужской Тогда
			Пол = 1;
		ИначеЕсли СтрокаТЗ.ПолПользователя = Перечисления.МИКО_мвПолПользователей.Женский Тогда
			Пол = 2;
		Иначе
			Пол = 0;
		КонецЕсли;
		
		МИКО_мвМаршрутизацияЗвонковСервер.ПросклонятьФразуКомпонента(Компонента, СтрокаТЗ.ФИОПользователя,2,СтрокаТЗ.ФИО_РП,Пол);
		МИКО_мвМаршрутизацияЗвонковСервер.ПросклонятьФразуКомпонента(Компонента, СтрокаТЗ.ФИОПользователя,3,СтрокаТЗ.ФИО_ДП,Пол);
		МИКО_мвМаршрутизацияЗвонковСервер.ПросклонятьФразуКомпонента(Компонента, СтрокаТЗ.ФИОПользователя,4,СтрокаТЗ.ФИО_ВП,Пол);
		МИКО_мвМаршрутизацияЗвонковСервер.ПросклонятьФразуКомпонента(Компонента, СтрокаТЗ.ФИОПользователя,5,СтрокаТЗ.ФИО_ТП,Пол);
		МИКО_мвМаршрутизацияЗвонковСервер.ПросклонятьФразуКомпонента(Компонента, СтрокаТЗ.ФИОПользователя,6,СтрокаТЗ.ФИО_ПП,Пол);
		
		ОбновитьСтатусЗаполнениПараметровСклонения(СтрокаТЗ);
		
		СтрокаТЗ.ОбновитьИнформацию = Истина;
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура Просклонять(Команда)
	
	Если Элементы.СписокПользователей.ТекущиеДанные <> Неопределено Тогда
		ПросклонятьНаСервере(Элементы.СписокПользователей.ТекущиеДанные.Пользователь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросклонятьВсе(Команда)
	
	ПросклонятьНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьПараметры(Команда)
	
	Если Элементы.ПоказатьПараметры.Пометка = Ложь Тогда
		
		Элементы.ГруппаПараметрыСклонения.Видимость = Истина;
		Элементы.ПоказатьПараметры.Пометка = Истина;
		
	Иначе
		
		Элементы.ГруппаПараметрыСклонения.Видимость = Ложь;
		Элементы.ПоказатьПараметры.Пометка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтборы(Команда)
	
	Элементы.ГруппаОтборы.Видимость = НЕ Элементы.ГруппаОтборы.Видимость;
	Элементы.СписокПользователейПоказатьНедействительных.Пометка = НЕ Элементы.СписокПользователейПоказатьНедействительных.Пометка;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЧЕЕ

&НаКлиенте
Процедура ПометитьМодифицированность(Элемент)
	
	Если Элемент = Неопределено ИЛИ Элементы.СписокПользователей.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЭтаФорма.Модифицированность = Истина;
	Элементы.СписокПользователей.ТекущиеДанные.ОбновитьИнформацию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Ответ, Параметры) Экспорт
	
	Вопрос = "";
	Если Ответ <> Неопределено И Параметры.Свойство("Вопрос", Вопрос) Тогда
		
		Если Вопрос = "СохранитьНастройки" Тогда
			
			Если Ответ = КодВозвратаДиалога.Да Тогда
				ЗаполнитьНаСервере();
				Закрыть();
			ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
				ЭтаФорма.Модифицированность = Ложь;
				Закрыть();
			Иначе
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьИзмененияНаСервере()

	Для каждого СтрДанных Из СписокПользователей Цикл
		Если СтрДанных.ОбновитьИнформацию Тогда
			Возврат;
		КонецЕсли; 
	КонецЦикла; 

	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры // ПроверитьИзмененияНаСервере()

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСтатусЗаполнениПараметровСклонения(СтрокаТаблицы)
	
	СтрокаТаблицы.ПараметрыСклоненияУказаны = 
		ЗначениеЗаполнено(СтрокаТаблицы.ФИО_РП) Или 
		ЗначениеЗаполнено(СтрокаТаблицы.ФИО_ДП) Или 
		ЗначениеЗаполнено(СтрокаТаблицы.ФИО_ТП) Или 
		ЗначениеЗаполнено(СтрокаТаблицы.ФИО_ВП) Или 
		ЗначениеЗаполнено(СтрокаТаблицы.ФИО_ПП);
	
КонецПроцедуры

// <Описание процедуры>
//
&НаКлиенте
Процедура УстановитьВидимостьЭлементов()

	Элементы.ГруппаОтборы.Видимость = Ложь;
	Элементы.СписокПользователейПоказатьНедействительных.Пометка = Ложь;

КонецПроцедуры // УстановитьВидимостьЭлементов()

// <Описание процедуры>
//
&НаСервере
Процедура УстановитьНачальныеОтборы()

	ТолькоАктивные = Истина;
	Элементы.СписокПользователей.ОтборСтрок = Новый ФиксированнаяСтруктура("Неактивен", Ложь);

КонецПроцедуры // УстановитьОтборы()

// #КонецОбласти
